# St7GetSRABaseExcitation

Returns the status of the Base Excitation setting for Spectral Response analysis.

long St7GetSRABaseExcitation(long uID, bool* Base)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Base

True if Base Excitation cases are included.